### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:23",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:19" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:19/invocations" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "19" -> (known after apply)
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "19" -> (known after apply)
!       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8" -> "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8/*/*"
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8" -> "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8/*/*"
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "8949119126341308377" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691884960562341000" -> "1691885527854178000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:23" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-13T00:04:17.755+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:23" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/8fb1f0691e67bf14171c1a761cf50a6d50654de127a008f243df33dfb18d32c5.zip" -> "builds/fe348839efa7f563b6eb1fb0471be4584166cb5980df7d6aa62df4090a65eae5.zip"
!       s3_object_version           = "Jqn9XxjKGvkPmOSfBYhJ5eM3NdvML0.o" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "VQBtdNXgDWiuOqu5Kb6oOt0aOtFU5qWHSVNRdeQ4zlw=" -> (known after apply)
!       source_code_size            = 26187775 -> (known after apply)
!       version                     = "23" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "6541099c79c820a64e92256471a5b609-5" -> (known after apply)
!       id                     = "builds/8fb1f0691e67bf14171c1a761cf50a6d50654de127a008f243df33dfb18d32c5.zip" -> (known after apply)
!       key                    = "builds/8fb1f0691e67bf14171c1a761cf50a6d50654de127a008f243df33dfb18d32c5.zip" -> "builds/fe348839efa7f563b6eb1fb0471be4584166cb5980df7d6aa62df4090a65eae5.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/8fb1f0691e67bf14171c1a761cf50a6d50654de127a008f243df33dfb18d32c5.zip" -> "builds/fe348839efa7f563b6eb1fb0471be4584166cb5980df7d6aa62df4090a65eae5.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "Jqn9XxjKGvkPmOSfBYhJ5eM3NdvML0.o" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/fe348839efa7f563b6eb1fb0471be4584166cb5980df7d6aa62df4090a65eae5.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/fe348839efa7f563b6eb1fb0471be4584166cb5980df7d6aa62df4090a65eae5.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2601159829632821251" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/8fb1f0691e67bf14171c1a761cf50a6d50654de127a008f243df33dfb18d32c5.zip" -> "builds/fe348839efa7f563b6eb1fb0471be4584166cb5980df7d6aa62df4090a65eae5.zip"
!           "timestamp" = "1691884962102957000" -> "1691885529288310000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "1551215335105393690" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/8fb1f0691e67bf14171c1a761cf50a6d50654de127a008f243df33dfb18d32c5.zip" -> "builds/fe348839efa7f563b6eb1fb0471be4584166cb5980df7d6aa62df4090a65eae5.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 8 to add, 1 to change, 7 to destroy.
```
</details>